---
type: ElementIntersectsFilter
namespace: Autodesk.Revit.DB
version: 2024
members: 3
tags: [revit-api, class]
---

# ElementIntersectsFilter

`Autodesk.Revit.DB.ElementIntersectsFilter` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | IsCategorySupported | 2012 | `public static bool IsCategorySupported ( Element element )` |
| Method | IsElementSupported | 2012 | `public static bool IsElementSupported ( Element element )` |
| Method | PassesFilter | — | `` |